#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

[32m[1mSuccess![0m The configuration is valid.
[0m

```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
azurerm_resource_group.rg: Refreshing state... [id=/subscriptions/909b8666-d049-4d5a-833a-2db9eb0a8aa2/resourceGroups/azeaprdportfolio]
azurerm_static_site.static_site: Refreshing state... [id=/subscriptions/909b8666-d049-4d5a-833a-2db9eb0a8aa2/resourceGroups/azeaprdportfolio/providers/Microsoft.Web/staticSites/azeaprdportfolio-ss]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # cloudflare_record.cloudflare_cname_record_main will be created
  + resource "cloudflare_record" "cloudflare_cname_record_main" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "marcobustillo.com"
      + proxiable       = (known after apply)
      + ttl             = 3600
      + type            = "CNAME"
      + value           = "icy-plant-054dba500.2.azurestaticapps.net"
      + zone_id         = "7a89ab4aa319cb37605a90188f978155"
    }

  # cloudflare_record.cloudflare_cname_record_www will be created
  + resource "cloudflare_record" "cloudflare_cname_record_www" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "www"
      + proxiable       = (known after apply)
      + ttl             = 3600
      + type            = "CNAME"
      + value           = "icy-plant-054dba500.2.azurestaticapps.net"
      + zone_id         = "7a89ab4aa319cb37605a90188f978155"
    }

Plan: 2 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @marcobustillo, Action: `pull_request`, Working Directory: `terraform`, Workflow: `Create terraform plan`*